erp3l.Доработка/src/DataProcessors/ллл_ЗагрузкаИсторическихДанныхПоРоссийскимПоставщикам/ллл_ЗагрузкаИсторическихДанныхПоРоссийскимПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ллл_ЗагрузкаИсторическихДанныхПоРоссийскимПоставщикам</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрочитаноИРаспознано</name>
    <attributes>
      <name>СрокОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиExcel</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентExcel</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СопоставленоКонтрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСчетаРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСчетаUSD</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСчетаEUR</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНакладной</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СопоставленоПТУ</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СопоставленоЗаказПоставщику</name>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>СоздаватьЗаявкуНаОплату</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СоздаватьДокументСписания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданаЗаявкаНаОплату</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданДокументСписания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Списание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Ошибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erp3l.Доработка/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26caefe6-3e76-4d73-9387-208213b91b67">
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0eec1c7a-4e84-488a-a0de-5ddf74b27a9c">
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a52a5aca-aa86-429b-b461-dbd79e1dbe24">
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="955ac7a2-906a-4d2b-9be1-a41ee11cec54">
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c89cfc05-3d8b-4809-9775-d96b96c1befb">
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7512207c-c53f-4c94-9c6d-70057ef0ebe0">
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be85d9cc-2632-45bb-a18a-01558fe3b7eb">
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c8cae29b-ba90-4b79-9584-2f9e9971dd25">
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c5718917-70eb-45ed-8147-7ede09e4567e">
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e46ad85d-8b38-4c69-800a-a5585af527ea">
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erp3l.Доработка/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="492f859c-898a-4672-ab31-9d0ca13acabc">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="5df46640-a48c-42a3-84ec-3c9f97ce2844">
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c0a070a8-fff5-49fe-8c9e-3fbae30394cb">
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="507f3953-94e1-46ef-8c8d-0688fd890a1d">
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8352fa6-99c0-4f4b-9227-b1ac7d158a3e">
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erp3l.Доработка/src/Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств/СтатусыЗаявокНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="22eba3bf-759c-463a-bb08-f0d1b4910ac9">
  <name>СтатусыЗаявокНаРасходованиеДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="fd602008-2753-4368-9638-8d3803d0e2b2">
    <name>Согласована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="97bb9b6a-7fb1-4a97-a53b-783fb8e84c2d">
    <name>НеСогласована</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a2703597-0f89-452e-b22a-4a3c82f7b70d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7ede1cab-9143-42b4-9eb3-fd405c68c64c">
    <name>Отклонена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erp3l.Доработка/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="985a22ad-c230-453e-a178-cf0ef164edd4">
  <name>ВидыДвиженийПриходРасход</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="a1914f0e-092a-4a0d-9760-536925d7eb7a">
    <name>Приход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d3af0748-49f7-4bdf-87cf-d46daa930103">
    <name>Расход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erp3l.Доработка/src/DataProcessors/ллл_ЗагрузкаИсторическихДанныхПоРоссийскимПоставщикам/ObjectModule.bsl
Процедура ОбработатьРаспознанныеДанныеМодуль() экспорт
	
	
	
	для каждого стр из ЭтотОбъект.ПрочитаноИРаспознано цикл
		еСЛИ стр.СоздаватьЗаявкуНаОплату тогда
			НаКакуюдатуСоздаватьЗаявку=?(ЗначениеЗаполнено(стр.ДатаОплаты),стр.ДатаОплаты,Текущаядата());		
			УстанавливатьСогласование=ЗначениеЗаполнено(стр.ДатаОплаты);
			
			
			Заявка=неопределено;
			
			
			Если ЗначениеЗаполнено(стр.СопоставленоПТУ) тогда
				Заявка=ллл_СоздатьЗаявкуНаОплатуИмпорт(стр.СопоставленоПТУ,
				НаКакуюдатуСоздаватьЗаявку,стр.СуммаСчетаРуб+стр.СуммаСчетаEUR+стр.СуммаСчетаUSD, УстанавливатьСогласование,стр.НомерСтрокиExcel,стр.СрокОплаты);
			
			иначеЕсли ЗначениеЗаполнено(стр.СопоставленоЗаказПоставщику) тогда
			
				Заявка=ллл_СоздатьЗаявкуНаОплатуИмпорт(стр.СопоставленоЗаказПоставщику,НаКакуюдатуСоздаватьЗаявку,стр.СуммаСчетаРуб+стр.СуммаСчетаEUR+стр.СуммаСчетаUSD, 
				УстанавливатьСогласование,стр.НомерСтрокиExcel,стр.СрокОплаты);			
			
			КонецЕсли;  
			
			
			Если значениеЗаполнено(Заявка) тогда 
				стр.СозданаЗаявкаНаОплату=истина; 
				стр.Заявка=Заявка;
				//если стр.Заявка.Проведен=ложь тогда
				//	стр.Ошибки="Не удалось провести заявку";
				//КонецЕсли;	
			конецЕсли;
				
				Если стр.СоздаватьДокументСписания тогда
					докСписания=СоздатьДокСписания(заявка,НаКакуюдатуСоздаватьЗаявку,стр.НомерСтрокиExcel);	 
					Если значениеЗаполнено(ДокСписания) тогда
						стр.СозданДокументСписания=истина;	
						стр.Списание=докСписания;
						
						
					если докСписания.Проведен=ложь тогда
						стр.Ошибки=стр.Ошибки+" Не удалось провести док. списания";
					КонецЕсли;	
						
						
						
					КонецЕсли;	
				КонецЕсли;	
			
			
		КонецЕсли;	
		
		
		
		
		
	КонеццИКЛА;      
	
	
	
	ДЛЯ КАЖДОГО СТР ИЗ    ЭтотОбъект.ПрочитаноИРаспознано ЦИКЛ
		если значениеЗаполнено(стр.Заявка) и стр.Заявка.Проведен=ложь тогда
			      Об=стр.Заявка.ПолучитьОбъект();
				  попытка
				  Об.Записать(режимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				  
			  	  исключение
				  
				   стр.ошибки=описаниеОшибки();
				  КонецПопытки;
				  
			
			
		КонецЕсли;	
		
		
	КонецЦикла;
	
	
	
	
	
	
	
КонецПроцедуры










Функция СоздатьДокСписания(заявка,ДатаОплаты,СтрокаExcel)
	ДокСписание=Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент(); 
	//ДокСписание.ЗаявкаНаРасходованиеДенежныхСредств=Заявка.Ссылка; 
	//ДокСписание.ДокументОснование=Заявка.Ссылка;
	ДокСписание.Видплатежа="электронно";
	ДокСписание.ТипПлатежногоДокумента=Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	ЗаполнитьЗначенияСвойств(ДокСписание,Заявка.Ссылка,,"Дата,Номер");
	стрДокСписание=ДокСписание.РасшифровкаПлатежа.Добавить();
	ЗаполнитьЗначенияСвойств(стрДокСписание,Заявка.Ссылка.РасшифровкаПлатежа[0]); 
	стрДокСписание.ЗаявкаНаРасходованиеДенежныхСредств=Заявка.Ссылка;
	стрДокСписание.ЦФО=ДокСписание.Организация;  
	стрДокСписание.СтатьяДвиженияДенежныхСредств  =ДокСписание.СтатьяДвиженияДенежныхСредств; 
	Если ЗначениеЗаполнено(ДатаОплаты) тогда
		ДокСписание.Дата=ДатаОплаты; 	
	иначе
		ДокСписание.Дата=ТекущаяДата(); 	
	КонецЕсли;
	
	
	ДокСписание.ОплатапоЗаявкам=истина;  
	доксПИСАНИЕ.ОчередностьПлатежа=1;
	ДокСписание.УстановитьНовыйНомер(ДокСписание.Организация.Префикс);
	ДокСписание.ДокументОснование=Заявка.Ссылка; 
	ДокСписание.ЗаявкаНаРасходованиеДенежныхСредств=Заявка.Ссылка;
	ДокСПисание.Проведенобанком=истина;
	ДокСписание.ДатаПроведенияБанком=Датаоплаты;           
	ДокСписание.Комментарий="Создано автоматически "+строка(СтрокаExcel);
	
	Запрос=Новый Запрос();
	Запрос.Текст= "
		|ВЫБРАТЬ
		|	РазмещениеЗаявок.ЗаявкаНаОперацию КАК ЗаявкаНаОперацию,
		|	РазмещениеЗаявок.ПриходРасход КАК ПриходРасход,
		|	РазмещениеЗаявок.ИдентификаторПозиции КАК ИдентификаторПозиции,
		|	РазмещениеЗаявок.БанковскийСчетКасса КАК БанковскийСчетКасса,
		|	РазмещениеЗаявок.Контрагент КАК Контрагент,
		|	РазмещениеЗаявок.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
		|	РазмещениеЗаявок.Сумма КАК Сумма,
		|	РазмещениеЗаявок.ФормаОплаты КАК ФормаОплаты,
		|	РазмещениеЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	РазмещениеЗаявок.Проведен КАК Проведен,
		|	РазмещениеЗаявок.КурсПлатежа КАК КурсПлатежа,
		|	РазмещениеЗаявок.УдалитьФормаОплаты КАК УдалитьФормаОплаты,
		|	РазмещениеЗаявок.ЗапретИзмененияДаты КАК ЗапретИзмененияДаты,
		|	РазмещениеЗаявок.ВалютаОплаты КАК ВалютаОплаты,
		|	РазмещениеЗаявок.ВидОперацииУХ КАК ВидОперацииУХ,
		|	РазмещениеЗаявок.ДатаИсполнения КАК ДатаИсполнения,
		|	РазмещениеЗаявок.СчетКонтрагента КАК СчетКонтрагента,
		|	РазмещениеЗаявок.ЗапретИзмененияБанковскогоСчетаКассы КАК ЗапретИзмененияБанковскогоСчетаКассы,
		|	РазмещениеЗаявок.ЗапретРазбиенияСлияния КАК ЗапретРазбиенияСлияния,
		|	РазмещениеЗаявок.ИдентификаторВстречнойПозиции КАК ИдентификаторВстречнойПозиции,
		|	РазмещениеЗаявок.КратностьПлатежа КАК КратностьПлатежа,
		|	РазмещениеЗаявок.Организация КАК Организация,
		|	РазмещениеЗаявок.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РазмещениеЗаявок.Приоритет КАК Приоритет,
		|	РазмещениеЗаявок.БезакцептноеСписание КАК БезакцептноеСписание,
		|	РазмещениеЗаявок.СпособОпределенияКурсаПлатежа КАК СпособОпределенияКурсаПлатежа,
		|	РазмещениеЗаявок.ДатаФиксацииКурсаПлатежа КАК ДатаФиксацииКурсаПлатежа,
		|	РазмещениеЗаявок.КурсПлатежаНеБолее КАК КурсПлатежаНеБолее,
		|	РазмещениеЗаявок.КурсПлатежаНеМенее КАК КурсПлатежаНеМенее,
		|	РазмещениеЗаявок.КурсПлатежаНеМенееВВалютеОплаты КАК КурсПлатежаНеМенееВВалютеОплаты,
		|	РазмещениеЗаявок.КурсПлатежаНеБолееВВалютеОплаты КАК КурсПлатежаНеБолееВВалютеОплаты,
		|	РазмещениеЗаявок.СдвигДатыФиксацииКурсаПлатежа КАК СдвигДатыФиксацииКурсаПлатежа,
		|	РазмещениеЗаявок.КрайняяДата КАК КрайняяДата
		|ИЗ
		|	РегистрСведений.РазмещениеЗаявок КАК РазмещениеЗаявок
		|ГДЕ
		|	РазмещениеЗаявок.ЗаявкаНаОперацию = &ЗаявкаНаОперацию";
		Запрос.УстановитьПараметр("ЗаявкаНаоперацию", Заявка);
		Результат=Запрос.Выполнить();
		Выборка=результат.Выбрать();
		если Выборка.Следующий() тогда
			
			стрДокСписание.КурсЧислительВзаиморасчетов=Выборка.КурсПлатежа;
			стрДокСписание.КурсЗнаменательВзаиморасчетов=Выборка.КратностьПлатежа;
			стрДокСписание.Сумма=стрДокСписание.СуммаВзаиморасчетов*стрДокСписание.КурсЧислительВзаиморасчетов/стрДокСписание.КурсЗнаменательВзаиморасчетов;
	        стрДокСписание.СуммаНДС=стрДокСписание.Сумма*стрДокСПисание.СтавкаНДС.Ставка/(100+ стрДокСПисание.СтавкаНДС.Ставка);
			ДокСписание.СуммаДокумента=стрДокСписание.Сумма;
			ДокСписание.Валюта=Справочники.Валюты.НайтиПоКоду("643");
			ДокСПисание.банковскийСчетКонтрагента=ллл_ПоискЗначений.НайтиБанковскийСчетКонтрагента(ДокСписание.Контрагент,ДокСПисание.Валюта);
			
			
			
		КонецЕсли;
	
	
	

	
	
	ДокСписание.Записать(РежимЗаписиДокумента.Запись);
	
	

	
	попытка

		ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
		
	
	исключение
	
	
	
	КонецПопытки;
	
	возврат(докСписание.Ссылка);
	
КонецФункции




Процедура УбитьУжеСуществующиеЗаявки(Заказ)
	
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаявкиЗаказа
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.ДокументОснование = &Заказ
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеБезналичныхДенежныхСредств.Ссылка КАК Платежка,
	|	СписаниеБезналичныхДенежныхСредств.ЗаявкаНаРасходованиеДенежныхСредств КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПлатежкиЗаявок
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|ГДЕ
	|	СписаниеБезналичныхДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	|	И СписаниеБезналичныхДенежныхСредств.ЗаявкаНаРасходованиеДенежныхСредств В
	|			(ВЫБРАТЬ
	|				з.Ссылка
	|			ИЗ
	|				ВТ_ЗаявкиЗаказа КАК з)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявкиЗаказа.Ссылка КАК Ссылка,
	|	ВТ_ПлатежкиЗаявок.Ссылка КАК Ссылка1
	|ИЗ
	|	ВТ_ЗаявкиЗаказа КАК ВТ_ЗаявкиЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлатежкиЗаявок КАК ВТ_ПлатежкиЗаявок
	|		ПО ВТ_ЗаявкиЗаказа.Ссылка = ВТ_ПлатежкиЗаявок.Ссылка
	|ГДЕ
	|	ВТ_ПлатежкиЗаявок.Ссылка ЕСТЬ NULL";
	
	

	Запрос.УстановитьПараметр("Заказ",Заказ);
	
	Результат=Запрос.Выполнить();
	Выборка=результат.Выбрать();
	пока ВЫборка.Следующий() цикл
		Если не ЗначениеЗаполнено(Выборка.Ссылка) тогда продолжить; конецЕсли;
		Об=ВЫборка.Ссылка.ПолучитьОбъект();
		Об.ПометкаУдаления=истина;
		Об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		Запрос2=Новый Запрос();
		Запрос2.Текст="ВЫБРАТЬ
	 |	ЭкземплярПроцесса.Ссылка КАК Ссылка
	 |ИЗ
	 |	Документ.ЭкземплярПроцесса КАК ЭкземплярПроцесса
	 |ГДЕ
	 |	ЭкземплярПроцесса.ПометкаУдаления = ЛОЖЬ
	 |	И ЭкземплярПроцесса.КлючевойОбъектПроцесса = &заявка";
		Запрос2.УстановитьПараметр("Заявка",Об.Ссылка);
		Результат2=Запрос2.Выполнить();
		Выборка2=Результат2.Выбрать();
		пока ВЫборка2.Следующий() цикл
			Об2=ВЫборка2.Ссылка.ПолучитьОбъект();
			Об2.ПометкаУдаления=истина;
			Об2.Записать(РежимЗаписиДокумента.ОтменаПроведения);
        КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


Функция ллл_СоздатьЗаявкуНаОплатуИмпорт(Заказ,ДатаПлатежа,СуммаПлатежа,УстанавливатьСогласованность,СтрокаExcel,ЖелаемаяДатаПлатежа)  

   ////попытка
   // Если типЗнч(Заказ)=тип("ДокументСсылка.ЗаказПоставщику") тогда
   // 	ЗаказОбъект=Заказ.ПолучитьОбъект();
   // 	ЗаказОбъект.ОбменДанными.Загрузка=истина; 
   // 	ЗаказОбъект.Согласован=истина;
   // 	ЗаказОбъект.Статус =Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;
   // 	ЗаказОбъект.Записать();
   // 	
   // 
   // КонецЕсли;	
   
   
   

   
    УбитьУжеСуществующиеЗаявки(Заказ);
   
   
   

	Заявка=Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
	Заявка.Заполнить(Заказ);
	Заявка.Комментарий="Создано автоматически "+строка(СтрокаExcel);
	СтавкаНДС=заказ.товары[0].СтавкаНДС;  
	Заявка.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтипоНаименованию("21.02_Приобретение товара РФ");		
    Заявка.ЖелательнаяДатаПлатежа=ЖелаемаяДатаПлатежа;

	
	
	
	Если Заказ.Хозяйственнаяоперация=Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту тогда
			ВалютаВзаиморасчетов=Заказ.Валюта;
			ВалютаДокумента=ВалютаВзаиморасчетов;
			Курс=1;
			Кратность=1;
		
		
	иначе	
	
		Если Заявка.Договор.ВалютаВзаиморасчетов<>Заявка.Договор.ОсновнаяВалютаПлатежей тогда
			ВалютаВзаиморасчетов=Заявка.Договор.ВалютаВзаиморасчетов;
			ВалютаДокумента=Справочники.Валюты.НайтиПоКоду("643");
			ТабКурс=РегистрыСведений.КурсыВалют.СрезПоследних(ДатаПлатежа,Новый Структура("Валюта",ВалютаВзаиморасчетов));
			Курс=ТабКурс[0].Курс;
			Кратность=ТабКурс[0].Кратность;
		иначе

			ВалютаВзаиморасчетов=Заявка.Договор.ВалютаВзаиморасчетов;
			ВалютаДокумента=ВалютаВзаиморасчетов;
			Курс=1;
			Кратность=1;
			
		КонецЕсли;	
	
	КонецЕсли;
	
	Заявка.СуммаДокумента=СуммаПлатежа;

	Заявка.Валюта=ВалютаВзаиморасчетов;
	Заявка.ВалютаОплаты=ВалютаДокумента; 
	Заявка.КурсПлатежа=Курс;
	Заявка.КратностьПлатежа=Кратность;
	Заявка.ДатаПлатежа=ДатаПлатежа; 
	Заявка.ЖелательнаяДатаПлатежа=ЖелаемаяДатаПлатежа;
	стр=Заявка.ДополнительныеРеквизиты.Добавить();
	стр.Свойство=ПланыВидовхарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Создано автоматически");
	стр.Значение=истина;
	РасшПлатежа=Заявка.расшифровкаПлатежа[0];
	РасшПлатежа.ВалютаВзаиморасчетов=Заявка.Валюта;
	РасшПлатежа.СуммаВзаиморасчетов=СуммаПлатежа; 
	РасшПлатежа.КурсЧислительВзаиморасчетов=Курс;
	РасшПлатежа.КурсЗнаменательВзаиморасчетов=Кратность;       
	РасшПлатежа.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтипоНаименованию("21.02_Приобретение товара РФ");
	Заявка.Внемаршрута=УстанавливатьСогласованность;;               
	Заявка.БанковскийСчетКонтрагента=ллл_ПоискЗначений.НайтиБанковскийСчетКонтрагента(Заявка.Контрагент,Заявка.ВалютаОплаты);
	Заявка.БанковскийСчет=ллл_ПоискЗначений.НайтиБанковскийСчетОрганизации(Заявка.Организация,Заявка.ВалютаОплаты);
	//РасшПлатежа.Сумма=СуммаПлатежа*Курс/Кратность;                                                                 
	Заявка.БанковскийСчетПолучатель  = ллл_ПоискЗначений.НайтиБанковскийСчетКонтрагента(Заявка.Контрагент,Заявка.ВалютаОплаты);
	РасшПлатежа.Сумма=СуммаПлатежа;
	РасшПлатежа.СуммаНДС=СуммаПлатежа/(100+СтавкаНДС.Ставка)*СтавкаНДС.Ставка;
	РасшПлатежа.ЭлементСтруктурыЗадолженности=Перечисления.ЭлементыСтруктурыЗадолженности.ОсновнойДолг;
	РасшПлатежа.Организация=Заявка.Организация;
	Заявка.ЦФО=Заявка.Организация;    
	РасшПлатежа.СтавкаНДС=СтавкаНДС; 
	//Заявка.НазначениеПлатежа="payment to invoice №" + заказ.НомерПоДаннымПоставщика+ 
	//" from " + Формат(Заказ.ДатаПоДаннымПоставщика,"ДФ=""гггг/ММ/дд""");
	
	//Заявка.Записать();   
	_ссылка=Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьСсылку();
	Заявка.УстановитьСсылкуНового(_ссылка);       
	Заявка.УстановитьНовыйНомер(Заявка.организация.Префикс); 
	Заявка.Дата=Датаплатежа-1; 
	Заявка.НалогообложениеНДС=Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Заявка.Приоритет=Справочники.ПриоритетыПлатежей.Неотложно;  


	Заявка.Записать(РежимЗаписиДокумента.Запись); 
	
	попытка
	
	Если  УстанавливатьСогласованность тогда
		Заявка.Статус=Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована;
		нз=РегистрыСведений.РегистрСостоянийОбъектов.СоздатьНаборЗаписей();
		нз.Отбор.Объект.Установить(_ссылка);
		нз.ПРочитать();
		нз.очистить();
		з=нз.Добавить();
		з.Объект=_ссылка;
		З.пЕРИОД=тЕКУЩАЯдАТА();
		з.СостояниеОбъекта=Перечисления.СостоянияСогласования.Утверждена;
		нз.Записывать=истина; 
		нз.Записать();  
	иначе
		Заявка.Записать(режимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		
		
		
		
	КонецЕсли;
	
	исключение
	
	
	КонецПопытки;
	
	
	
	
	Менеджер=ллл_ПоискЗначений.НайтиСоздатьЗаписьПлатежнойПозиции(Заявка.Ссылка);
	Если не ЗначениеЗаполнено(Менеджер.ИдентификаторПозиции) тогда
		Менеджер.ИдентификаторПозиции=Новый УникальныйИдентификатор();
		
	КонецЕсли;
	Менеджер.ЗаявкаНаОперацию=Заявка.Ссылка;
	ЗаполнитьЗначенияСвойств(Менеджер,Заявка.Ссылка); 
	Менеджер.СуммаВзаиморасчетов=СуммаПлатежа;
	Менеджер.ВалютаВзаиморасчетов=заявка.Договор.ВалютаВзаиморасчетов;
	Менеджер.Сумма =Менеджер.СуммаВзаиморасчетов*Курс/Кратность;   
	Менеджер.Датаисполнения=ДатаПлатежа;
	Менеджер.КурсПлатежа=Курс;
	Менеджер.КратностьПлатежа=Кратность;		
	Менеджер.ДатаФиксацииКурсаПлатежа=ДатаПлатежа;
	Менеджер.СчетКонтрагента=Заявка.БанковскийСчетКонтрагента;
	Менеджер.ПРиходРасход=Перечисления.ВидыДвиженийПриходРасход.Расход;  
	Менеджер.ВалютаОплаты=Справочники.Валюты.НайтиПоКоду("643");
	Менеджер.Записать();
  
	//Заявка.Записать(РежимЗаписиДокумента.Проведение);  
	возврат(Заявка.Ссылка);

	//исключение
	//
	//	возврат(неопределено);	
	//КонецПопытки;
КонецФункции
